
Процедура ПередЗаписью(Отказ)
	Если Не ОбменДанными.Загрузка Тогда
		Код = Гастроном.СловоНормализовать(Код);
	КонецЕсли;
	Если НЕ ПустаяСтрока(Код) Тогда
		Буквы.Очистить();
		Для Символ = 1 По СтрДлина(Код) Цикл
			ТекСтрока = Буквы.Найти(Сред(Код, Символ, 1), "Буква");
			Если ТекСтрока = Неопределено Тогда
				ТекСтрока = Буквы.Добавить();
				ТекСтрока.Буква = Сред(Код, Символ, 1);
			КонецЕсли;
			ТекСтрока.Количество = ТекСтрока.Количество + 1;
		КонецЦикла;
		Буквы.Сортировать("Буква");
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Буквы.Очистить();
КонецПроцедуры
