
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ДиалогВыбораФайла =	РаботаСДиалогами.ДиалогВыбораФайлаИмпортаСоздать(Истина);
	Если ДиалогВыбораФайла = Неопределено Тогда
	ИначеЕсли ДиалогВыбораФайла.Выбрать() Тогда
		Для Каждого ИмяФайла Из ДиалогВыбораФайла.ВыбранныеФайлы Цикл
			ИмпортРетро(ИмяФайла);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ИмпортРетро(ИмяФайла)
	Попытка
		ДокЭкспо = Новый ТекстовыйДокумент;
		ДокЭкспо.ТолькоПросмотр	= Истина;
		ДокЭкспо.Прочитать(ИмяФайла, "UTF-8");
		ТекТекст = ДокЭкспо.ПолучитьТекст();
		Если Найти(ТекТекст, "а") = 0 Тогда
			ДокЭкспо.Прочитать(ИмяФайла, "windows-1251");
			ТекТекст = ДокЭкспо.ПолучитьТекст();
			Если Найти(ТекТекст, "а") = 0 Тогда
				Сообщить("Не удалось определить кодировку " + ИмяФайла);
				Возврат;
			КонецЕсли;
		КонецЕсли;

		ТекСтрока	= 0;
		КоличествоСтрокОшибочных = 0;
		Добавлено	= 0;
		Пока КоличествоСтрокОшибочных < 777 Цикл
			ТекСтрока = ТекСтрока + 1;
			ТекТекст = Гастроном.СловоНормализовать(ДокЭкспо.ПолучитьСтроку(ТекСтрока));
			Если ПустаяСтрока(ТекТекст) Тогда
				КоличествоСтрокОшибочных = КоличествоСтрокОшибочных + 1;
			ИначеЕсли Справочники.Слова.НайтиПоКоду(ТекТекст).Пустая() Тогда
				ТекСлово = Справочники.Слова.СоздатьЭлемент();
				ТекСлово.ОбменДанными.Загрузка = Истина;
				ТекСлово.Код = ТекТекст;
				ТекСлово.Записать();
				
				Добавлено	= Добавлено + 1;
			КонецЕсли;
		КонецЦикла;
		Сообщить("Добавлено слов " + Строка(Добавлено));
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
	КонецПопытки;
КонецПроцедуры
