
Функция ДиалогВыбораФайлаИмпортаСоздать(МножественныйВыбор=Ложь) Экспорт
	#Если ВебКлиент Тогда
		Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
			УстановитьРасширениеРаботыСФайлами();
			Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
				Сообщить("В Веб-клиенте без установленного расширения работы с файлами выбор файлов не поддерживается");
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	ДиалогВыбораФайла =	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр						= "Текстовый файл (*.txt)|*.txt";
	ДиалогВыбораФайла.Расширение					= "txt";
	ДиалогВыбораФайла.Заголовок						= "Выберите файлы";
	ДиалогВыбораФайла.МножественныйВыбор			= МножественныйВыбор;
	ДиалогВыбораФайла.ПредварительныйПросмотр		= Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	= Истина;
	Возврат ДиалогВыбораФайла;
КонецФункции
